Revit 2027 API
ExternalResourceTypes.BuiltInExternalResourceTypes.DecalMap Property
 An external resource type representing Decal linked data for diffuse. This type is reserved for future expansion but not yet implemented.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ExternalResourceType DecalMap { get; }
Public Shared ReadOnly Property DecalMap As ExternalResourceType
	Get
public:
static property ExternalResourceType^ DecalMap {
	ExternalResourceType^ get ();
}
static member DecalMap : ExternalResourceType with get
Property Value
ExternalResourceType
See Also
Reference
ExternalResourceTypes.BuiltInExternalResourceTypes Class
Autodesk.Revit.DB Namespace